In [1]:
# Import Libraries
import pandas as pd

In [2]:
# Load Dataset
df = pd.read_csv('data/salaries.csv')

In [3]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,EN,FT,Cyber Security Analyst,45000,EUR,50000,FR,50,FR,L
1,2024,SE,FT,Security Architect,300000,USD,300000,US,0,US,M
2,2024,SE,FT,Security Architect,200000,USD,200000,US,0,US,M
3,2024,EX,FT,Privacy Officer,297000,USD,297000,US,0,US,M
4,2024,EX,FT,Privacy Officer,216000,USD,216000,US,0,US,M

In [4]:
df.info

<bound method DataFrame.info of       work_year experience_level employment_type  \
0          2024               EN              FT
1          2024               SE              FT
2          2024               SE              FT
3          2024               EX              FT
4          2024               EX              FT
...         ...              ...             ...
5325       2020               MI              FT
5326       2021               SE              FT
5327       2021               SE              FT
5328       2021               MI              FT
5329       2021               MI              FT

                         job_title  salary salary_currency  salary_in_usd  \
0           Cyber Security Analyst   45000             EUR          50000
1               Security Architect  300000             USD         300000
2               Security Architect  200000             USD         200000
3                  Privacy Officer  297000             USD         297000
4                  Privacy Officer  216000             USD         216000
...                            ...     ...             ...            ...
5325        Cyber Security Analyst  140000             AUD          96422
5326  Information Security Manager   60000             GBP          82528
5327  Penetration Testing Engineer  126000             USD         126000
5328  Information Security Analyst   42000             GBP          57769
5329   Threat Intelligence Analyst   66310             USD          66310

     employee_residence  remote_ratio company_location company_size
0                    FR            50               FR            L
1                    US             0               US            M
2                    US             0               US            M
3                    US             0               US            M
4                    US             0               US            M
...                 ...           ...              ...          ...
5325                 AU            50               AU            M
5326                 GB            50               GB            L
5327                 US           100               US            L
5328                 GB           100               GB            L
5329                 US             0               US            L

[5330 rows x 11 columns]>

In [5]:
df.shape

(5330, 11)

In [6]:
df.describe()

         work_year        salary  salary_in_usd  remote_ratio
count  5330.000000  5.330000e+03    5330.000000   5330.000000
mean   2022.548968  3.652264e+05  146232.111069     41.772983
std       0.823938  1.069612e+07   63996.566877     47.801635
min    2020.000000  1.640000e+04   15897.000000      0.000000
25%    2022.000000  1.005000e+05  100000.000000      0.000000
50%    2023.000000  1.400000e+05  138000.000000      0.000000
75%    2023.000000  1.830000e+05  180000.000000    100.000000
max    2024.000000  6.000000e+08  700000.000000    100.000000

In [7]:
df.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object